<?php

namespace Faker\Provider\ar_EG;

class Address extends \Faker\Provider\Address
{
    protected static $cityPrefix = array('شمال', 'شرق', 'غرب', 'جنوب', 'جديد', 'بحيرة', 'بورت');
    protected static $citySuffix = array('مدينة', 'تون', 'ارض', 'قرية', 'ميت', );
    protected static $buildingNumber = array('#####', '####', '###');
    protected static $streetSuffix = array(
        'شارع', 'حي', 'زقاق', 'كبري', 'تقاطع', 'امام', 'خلف', 'بجانب', 'قبل', 'بعد', 'يمين', 'يسار'
    );
    protected static $postcode = array('#####', '#####-####');
    protected static $state = array(
       'اﻷﻗﺼﺮ' ,'اﻟﺴﻮﻳﺲ' ,'ﺟﻨﻮﺏ ﺳﻴﻨﺎء' ,'ﺳﻮﻫﺎﺝ' ,'اﻟﺸﺮﻗﻴﺔ' ,'اﻟﺒﺤﺮ اﻷﺣﻤﺮ' ,'ﻗﻨﺎ' ,'اﻟﻘﻠﻴﻮﺑﻴﺔ' ,'ﺑﻮﺭﺳﻌﻴﺪ' ,'ﺷﻤﺎﻝ ﺳﻴﻨﺎء' ,'اﻟﻮاﺩﻱ اﻟﺠﺪﻳﺪ' ,'اﻟﻤﻨﻮﻓﻴﺔ' ,'اﻟﻤﻨﻴﺎ' ,'ﻣﻄﺮﻭﺡ' ,'ﻛﻔﺮ اﻟﺸﻴﺦ' ,'اﻹﺳﻤﺎﻋﻴﻠﻴﺔ' ,'اﻟﺠﻴﺰﺓ' ,'اﻟﻐﺮﺑﻴﺔ' ,'اﻟﻔﻴﻮﻡ' ,'ﺩﻣﻴﺎﻁ' ,'اﻟﺪﻗﻬﻠﻴﺔ' ,'اﻟﻘﺎﻫﺮﺓ' ,'ﺑﻨﻲ ﺳﻮﻳﻒ' ,'اﻟﺒﺤﻴﺮﺓ' ,'ﺃﺳﻴﻮﻁ' ,'ﺃﺳﻮاﻥ'
    );
    protected static $stateAbbr = array(
        'AL', 'AK', 'AS', 'AZ', 'AR', 'CA', 'CO', 'CT', 'DE', 'DC', 'FM', 'FL', 'GA', 'GU', 'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'KY', 'LA', 'ME', 'MH', 'MD', 'MA', 'MI', 'MN', 'MS', 'MO', 'MT', 'NE', 'NV', 'NH', 'NJ', 'NM', 'NY', 'NC', 'ND', 'MP', 'OH', 'OK', 'OR', 'PW', 'PA', 'PR', 'RI', 'SC', 'SD', 'TN', 'TX', 'UT', 'VT', 'VI', 'VA', 'WA', 'WV', 'WI', 'WY', 'AE', 'AA', 'AP'
    );
    protected static $country = array(
        'اليابان', 'الإمارات العربية المتحدة', 'الولايات المتحدة الأمريكية', 'أندورا', 'دولة قطر', 'دولة الكويت', 'ليختنشتاين', 'موناكو', 'الفاتيكان', 'ليبيا', ' إثيوبيا', ' أذربيجان', ' إرتيريا', ' الأرجنتين', 
        ' أرمينيا', ' إستونيا', ' إسرائيل', ' أفغانستان', ' إكوادور', ' ألبانيا', ' أنغولا', 
        ' باكستان', ' البرازيل', ' البرتغال', ' البوسنة والهرسك', ' الجزائر', ' الجبل الأسود', ' إلسلفادور',
        ' السودان', ' الصومال', ' الصين', ' العراق', ' الغابون', ' كاميرون', ' ألمانيا', ' المكسيك', ' النمسا', ' الهند', ' جمهورية أفريقيا الوسطى', ' الرأس الأخضر', ' الولايات المتحدة', ' اليمن', 
        ' اليونان', ' إندونيسيا', ' أوروغواي', ' أوزبكستان', ' أوغندا', ' أوكرانيا', ' إيران', ' أيرلندا', ' أيسلندا', ' إيطاليا', ' باراغواي', ' بالاو]', ' بلغاريا', ' بنغلاديش', ' بنين', ' بوليفيا', ' بوتسوانا', ' بنما', ' بوركينا فاسو',
        ' بوروندي', ' بولندا', ' بيرو', ' تايوان', ' تركمانستان', ' تركيا', ' ترينيداد وتوباغو', ' تشاد', ' جمهورية التشيك', ' تشيلي', ' تنزانيا', ' توجو', ' تونس', ' تيمور الشرقية', ' جرينادا', ' جزر القمر', ' جزر مارشال', 
        ' الكونغو', ' الكونغو الديمقراطية', ' جنوب أفريقيا', ' جورجيا', ' جيبوتي', ' دومينيكا', ' دولة فلسطين', ' رواندا', ' روسيا', ' رومانيا', ' زامبيا', ' زيمبابوي', ' كوت ديفوار', ' ساموا', ' سان مارينو', ' ساو تومي وبرينسيب', 
        ' سريلانكا', ' سلوفاكيا', ' سلوفينيا', ' سنغافورة', ' السنغال', ' سورية', ' سورينام', ' سويسرا', ' سيراليون', ' سيشيل', ' صربيا', ' طاجيكستان', ' غامبيا', ' غانا', ' غواتيمالا', ' غويانا', ' غينيا', ' غينيا الاستوائية',
        ' غينيا بيساو', ' فانواتو', ' فرنسا', ' الفلبين', ' فنلندا', ' فنزويلا', ' فيتنام', ' فيجي', ' قبرص', ' قيرغيزستان', ' كازاخستان', ' كرواتيا', ' كوبا', ' كوريا الشمالية', ' كوريا الجنوبية', ' كوستاريكا', ' كولومبيا', ' كيريباتي',
        ' كينيا', ' لاتفيا', ' لاوس', ' لبنان', ' لتوانيا', ' ليبيريا', ' مدغشقر', ' مصر', ' جمهورية مقدونيا', ' مالطا', ' مالي', ' منغوليا', ' موريشيوس', ' موزمبيق', ' مولدافيا', ' ملاوي', ' مالديف', ' موريتانيا', ' ميانمار', 
        ' ناميبيا', ' ناورو', ' نيبال', ' النيجر', ' نيجيريا', ' نيكاراجوا', ' هايتي', ' هندوراس', ' المجر', ' يوغوسلافيا', ' سلطنة بروناي', 'سلطنة عمان', 'أسبانيا', 'أستراليا', 'المملكة الأردنية الهاشمية', 'المملكة العربية السعودية', 'المملكة المتحدّة', 
        'المملكة المغربية', 'الدانمارك', 'السويد', 'النروج',
    );
    protected static $cityFormats = array(
        '{{cityPrefix}} {{firstName}}{{citySuffix}}',
        '{{cityPrefix}} {{firstName}}',
        '{{firstName}}{{citySuffix}}',
        '{{lastName}}{{citySuffix}}',
    );
    protected static $streetNameFormats = array(
        '{{firstName}} {{streetSuffix}}',
        '{{lastName}} {{streetSuffix}}'
    );
    protected static $streetAddressFormats = array(
        '{{buildingNumber}} {{streetName}}',
        '{{buildingNumber}} {{streetName}} {{secondaryAddress}}',
    );
    protected static $addressFormats = array(
        "{{streetAddress}}\n{{city}}, {{stateAbbr}} {{postcode}}",
    );
    protected static $secondaryAddressFormats = array('Apt. ###', 'Suite ###');

    /**
     * @example 'East'
     */
    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }

    /**
     * @example 'Appt. 350'
     */
    public static function secondaryAddress()
    {
        return static::numerify(static::randomElement(static::$secondaryAddressFormats));
    }

    /**
     * @example 'California'
     */
    public static function state()
    {
        return static::randomElement(static::$state);
    }

    /**
     * @example 'CA'
     */
    public static function stateAbbr()
    {
        return static::randomElement(static::$stateAbbr);
    }
}
