<?php

namespace Faker\Provider\ar_EG;

class Person extends \Faker\Provider\Person {

    protected static $formats = array(
        '{{firstName}} {{lastName}}',
        '{{firstName}} {{lastName}}',
        '{{firstName}} {{lastName}}',
        '{{firstName}} {{lastName}}',
        '{{firstName}} {{lastName}}',
        '{{prefix}} {{firstName}} {{lastName}}',
        '{{firstName}} {{lastName}} {{suffix}}',
        '{{prefix}} {{firstName}} {{lastName}} {{suffix}}'
    );
    protected static $firstName = array(
        'عشور', 'عبد الفتاح', 'علي', 'أنطوني', 'عبد المنعم', 'علاء', 'أسلم', 'عبد الله', 'أولي جاما', 'أنس', 'عبود', 'أحمد', 'أكرم', 'أمين', 'أمجد', 'عَمر', 'أنيس', 'عمار', 'عطه', 'عبد العزيز', 'أيمن', 'أديب', 'عفيفة', 'عيني', 'أمل', 'أمير', 'أفرا', 'ألماس', 'أمينة', 'آية', 'أبدقاني', 'أفنان', 'أمت السلام', 'أنابيا', 'عايشة', 'بشار', 'برهان', 'باسل', 'بسيم', 'بشر', 'بهى', 'بهير', 'باسم', 'بلال', 'بدر', 'بدر الدين', 'بركة', 'بسيل', 'بطرس', 'بشرى', 'كارمين', 'قنطرة', 'كايتلين', 'شمس', 'دوانا', 'دابر', 'ضياء الدين', 'ضحى', 'دلال', 'دانيا', 'ضياء', 'آمير', 'عصام', 'إيهاب', 'إميلي', 'فرحان', 'فَلاح', 'فادي', 'فريدفس', 'فوزية', 
        'غريس', 'غبريالا', 'حسام', 'هيثم', 'حيدر', 'هشام', 'حسن', 'حمزة', 'هيفى، هيفاء', 'هجرى', 'حفصى', 'هبة', 'هاجر', 'هداية', 'حنان', 'عصام', 'إسهامي', 'عزتي', 'إيمان', 'إسراء', 'عزة', 'يشم', 'جاويد=', 'جوهرة', 'جفريا', 'جميلة', 'كريم', 'خليل', 'خالد', 'خضر', 'خديجة', 'لقمان الحكيم', 'لينا', 'ليلى', 'ليلى', 'مصطفى', 'محمد', 'مشتاق', 'ماهر', 'مبارك', 'محمود', 'مهند', 'منتهى', 'مينى', 'محسنة', 'نديم', 'نينوس', 'نسيم', 'نور', 'نظيف', 'ناصر', 'نبيل', 'نصر', 'نغمة', 'نور', 'نفين', 'نايف', 'نسمة', 'نجاة', 'نور', 'نجية', 'نجمة', 'نادين', 'أسامة', 'عمر', 'أسامة', 'بيتر', 'قاسم', 'رشيد', 'ريم', 'راما', 
        'روان', 'روبي', 'سعيد', 'صلاح', 'سامر', 'صبري', 'صالح', 'جميل', 'شمامة', 'شهد', 'سناء', 'شوكيرا', 'صفاء', 'شذى', 'سهام', 'سالي', 'سوزان', 'سمر', 'سامية', 'تامر', 'تميم', 'طلعت', 'تمار', 'توشانا', 'أمل الخير', 'وليد', 'وسام', 'وجه', 'وجدي', 'وادي', 'وحيد', 'وجيه', 'وكيل', 'وليد', 'ولي الله', 'وسيم', 'وزير', 'وقار', 'وفى', 'يحيى', 'يعقوب', 'ياسمين', 'يسرى', 'يمنى', 'زفير', 'زاهذ', 'ظهير', 'زيد', 'زيم', 'زكريا', 'زكي', 'زكية', 'زياد', 'زهير', 'ذو الفقار', 'زهيرة', 'زارا',
    );
    protected static $lastName = array(
        'عشور', 'عبد الفتاح', 'علي', 'أنطوني', 'عبد المنعم', 'علاء', 'أسلم', 'عبد الله', 'أولي جاما', 'أنس', 'عبود', 'أحمد', 'أكرم', 'أمين', 'أمجد', 'عَمر', 'أنيس', 'عمار', 'عطه', 'عبد العزيز', 'أيمن', 'أديب', 'عفيفة', 'عيني', 'أمل', 'أمير', 'أفرا', 'ألماس', 'أمينة', 'آية', 'أبدقاني', 'أفنان', 'أمت السلام', 'أنابيا', 'عايشة', 'بشار', 'برهان', 'باسل', 'بسيم', 'بشر', 'بهى', 'بهير', 'باسم', 'بلال', 'بدر', 'بدر الدين', 'بركة', 'بسيل', 'بطرس', 'بشرى', 'كارمين', 'قنطرة', 'كايتلين', 'شمس', 'دوانا', 'دابر', 'ضياء الدين', 'ضحى', 'دلال', 'دانيا', 'ضياء', 'آمير', 'عصام', 'إيهاب', 'إميلي', 'فرحان', 'فَلاح', 'فادي', 'فريدفس', 'فوزية', 
        'غريس', 'غبريالا', 'حسام', 'هيثم', 'حيدر', 'هشام', 'حسن', 'حمزة', 'هيفى، هيفاء', 'هجرى', 'حفصى', 'هبة', 'هاجر', 'هداية', 'حنان', 'عصام', 'إسهامي', 'عزتي', 'إيمان', 'إسراء', 'عزة', 'يشم', 'جاويد=', 'جوهرة', 'جفريا', 'جميلة', 'كريم', 'خليل', 'خالد', 'خضر', 'خديجة', 'لقمان الحكيم', 'لينا', 'ليلى', 'ليلى', 'مصطفى', 'محمد', 'مشتاق', 'ماهر', 'مبارك', 'محمود', 'مهند', 'منتهى', 'مينى', 'محسنة', 'نديم', 'نينوس', 'نسيم', 'نور', 'نظيف', 'ناصر', 'نبيل', 'نصر', 'نغمة', 'نور', 'نفين', 'نايف', 'نسمة', 'نجاة', 'نور', 'نجية', 'نجمة', 'نادين', 'أسامة', 'عمر', 'أسامة', 'بيتر', 'قاسم', 'رشيد', 'ريم', 'راما', 
        'روان', 'روبي', 'سعيد', 'صلاح', 'سامر', 'صبري', 'صالح', 'جميل', 'شمامة', 'شهد', 'سناء', 'شوكيرا', 'صفاء', 'شذى', 'سهام', 'سالي', 'سوزان', 'سمر', 'سامية', 'تامر', 'تميم', 'طلعت', 'تمار', 'توشانا', 'أمل الخير', 'وليد', 'وسام', 'وجه', 'وجدي', 'وادي', 'وحيد', 'وجيه', 'وكيل', 'وليد', 'ولي الله', 'وسيم', 'وزير', 'وقار', 'وفى', 'يحيى', 'يعقوب', 'ياسمين', 'يسرى', 'يمنى', 'زفير', 'زاهذ', 'ظهير', 'زيد', 'زيم', 'زكريا', 'زكي', 'زكية', 'زياد', 'زهير', 'ذو الفقار', 'زهيرة', 'زارا',
    );
    private static $prefix = array('أ.', 'أ.', 'أنسة.', 'مدام', 'دكتور.');
    private static $suffix = array('Jr.', 'Sr.', 'I', 'II', 'III', 'IV', 'V', 'MD', 'DDS', 'PhD', 'DVM');

    /**
     * @example 'Mrs.'
     */
    public static function prefix() {
        return static::randomElement(static::$prefix);
    }

    /**
     * @example 'PhD'
     */
    public static function suffix() {
        return static::randomElement(static::$suffix);
    }

}
